app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Testing post"], ["content", "Testing post with email"], ["user_id", 2], ["created_at", "2016-04-05 01:11:54.854698"], ["updated_at", "2016-04-05 01:11:54.854698"]]
---
  def create
    @user = current_user
    @post = @user.posts.new(post_params)  #Post.new(post_params)

    respond_to do |format|
      if @post.save